## Plan Result (1112: sbox_aria - Terraform Plan Apply)




### :warning: Resource Deletion will happen :warning:
This plan contains resource delete operation. Please check the plan result very carefully!

<pre><code>Plan: 7 to add, 0 to change, 7 to destroy.</code></pre>

* Create
  * azurerm_linux_function_app.example[&#34;02-af-apflpa-sbox-uks-dlrm-01&#34;]
  * azurerm_linux_function_app.example[&#34;02-af-apl-sbox-uks-dlrm-01&#34;]
  * azurerm_linux_function_app.example[&#34;02-af-apluta-sbox-uks-dlrm-01&#34;]
  * azurerm_linux_function_app.example[&#34;02-af-bails-sbox-uks-dlrm-01&#34;]
  * azurerm_linux_function_app.example[&#34;02-af-joh-sbox-uks-dlrm-01&#34;]
  * azurerm_linux_function_app.example[&#34;02-af-sbails-sbox-uks-dlrm-01&#34;]
  * azurerm_linux_function_app.example[&#34;02-af-td-sbox-uks-dlrm-01&#34;]
* Delete
  * azurerm_storage_account.example[&#34;00-af-td-sbox-uks-dlrm-01&#34;]
  * azurerm_storage_account.example[&#34;02-af-apflpa-sbox-uks-dlrm-01&#34;]
  * azurerm_storage_account.example[&#34;02-af-apl-sbox-uks-dlrm-01&#34;]
  * azurerm_storage_account.example[&#34;02-af-apluta-sbox-uks-dlrm-01&#34;]
  * azurerm_storage_account.example[&#34;02-af-bails-sbox-uks-dlrm-01&#34;]
  * azurerm_storage_account.example[&#34;02-af-joh-sbox-uks-dlrm-01&#34;]
  * azurerm_storage_account.example[&#34;02-af-sbails-sbox-uks-dlrm-01&#34;]




<details><summary>Change Result (Click me)</summary>

```hcl

  # azurerm_linux_function_app.example["02-af-apflpa-sbox-uks-dlrm-01"] will be created
  + resource "azurerm_linux_function_app" "example" {
      + app_settings                                   = {
          + "APPLICATIONINSIGHTS_CONNECTION_STRING"                 = (sensitive value)
          + "AzureWebJobsFeatureFlags"                              = "EnableWorkerIndexing"
          + "BUILD_FLAGS"                                           = "UseExpressBuild"
          + "ENABLE_ORYX_BUILD"                                     = "true"
          + "FUNCTIONS_WORKER_RUNTIME"                              = "python"
          + "PYTHON_ENABLE_WORKER_EXTENSIONS"                       = "1"
          + "SCM_DO_BUILD_DURING_DEPLOYMENT"                        = "1"
          + "WEBSITE_RUN_FROM_PACKAGE"                              = "1"
          + "XDG_CACHE_HOME"                                        = "/tmp/.cache"
          + "sboxdlrmeventhubns_RootManageSharedAccessKey_EVENTHUB" = (sensitive value)
        }
      + builtin_logging_enabled                        = true
      + client_certificate_enabled                     = false
      + client_certificate_mode                        = "Optional"
      + content_share_force_disabled                   = false
      + custom_domain_verification_id                  = (sensitive value)
      + daily_memory_time_quota                        = 0
      + default_hostname                               = (known after apply)
      + enabled                                        = true
      + ftp_publish_basic_authentication_enabled       = true
      + functions_extension_version                    = "~4"
      + hosting_environment_id                         = (known after apply)
      + https_only                                     = false
      + id                                             = (known after apply)
      + key_vault_reference_identity_id                = (known after apply)
      + kind                                           = (known after apply)
      + location                                       = "uksouth"
      + name                                           = "af-apflpa-sbox-uks-dlrm-01"
      + outbound_ip_address_list                       = (known after apply)
      + outbound_ip_addresses                          = (known after apply)
      + possible_outbound_ip_address_list              = (known after apply)
      + possible_outbound_ip_addresses                 = (known after apply)
      + public_network_access_enabled                  = true
      + resource_group_name                            = "ingest02-main-sbox"
      + service_plan_id                                = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/ingest02-main-sbox/providers/Microsoft.Web/serverFarms/af-apflpa-sbox-uks-dlrm-01"
      + site_credential                                = (sensitive value)
      + storage_account_access_key                     = (sensitive value)
      + storage_account_name                           = "ingest02xcuttingsbox"
      + storage_uses_managed_identity                  = false
      + tags                                           = {
          + "application"  = "dlrm-data-ingest"
          + "builtFrom"    = "hmcts/dlrm-data-ingest-aria"
          + "businessArea" = "cross-cutting"
          + "criticality"  = "Low"
          + "environment"  = "sandbox"
          + "expiresAfter" = "3000-01-01"
        }
      + virtual_network_backup_restore_enabled         = false
      + vnet_image_pull_enabled                        = false
      + webdeploy_publish_basic_authentication_enabled = true
      + zip_deploy_file                                = (known after apply)

      + site_config {
          + always_on                               = false
          + app_scale_limit                         = (known after apply)
          + container_registry_use_managed_identity = false
          + default_documents                       = (known after apply)
          + detailed_error_logging_enabled          = (known after apply)
          + elastic_instance_minimum                = (known after apply)
          + ftps_state                              = "Disabled"
          + http2_enabled                           = false
          + ip_restriction_default_action           = "Allow"
          + linux_fx_version                        = (known after apply)
          + load_balancing_mode                     = "LeastRequests"
          + managed_pipeline_mode                   = "Integrated"
          + minimum_tls_version                     = "1.2"
          + pre_warmed_instance_count               = (known after apply)
          + remote_debugging_enabled                = false
          + remote_debugging_version                = (known after apply)
          + scm_ip_restriction_default_action       = "Allow"
          + scm_minimum_tls_version                 = "1.2"
          + scm_type                                = (known after apply)
          + scm_use_main_ip_restriction             = false
          + use_32_bit_worker                       = false
          + vnet_route_all_enabled                  = false
          + websockets_enabled                      = false
          + worker_count                            = (known after apply)

          + application_stack {
              + python_version              = "3.10"
              + use_dotnet_isolated_runtime = false
            }
        }
    }

  # azurerm_linux_function_app.example["02-af-apl-sbox-uks-dlrm-01"] will be created
  + resource "azurerm_linux_function_app" "example" {
      + app_settings                                   = {
          + "APPLICATIONINSIGHTS_CONNECTION_STRING"                 = (sensitive value)
          + "AzureWebJobsFeatureFlags"                              = "EnableWorkerIndexing"
          + "BUILD_FLAGS"                                           = "UseExpressBuild"
          + "ENABLE_ORYX_BUILD"                                     = "true"
          + "FUNCTIONS_WORKER_RUNTIME"                              = "python"
          + "PYTHON_ENABLE_WORKER_EXTENSIONS"                       = "1"
          + "SCM_DO_BUILD_DURING_DEPLOYMENT"                        = "1"
          + "WEBSITE_RUN_FROM_PACKAGE"                              = "1"
          + "XDG_CACHE_HOME"                                        = "/tmp/.cache"
          + "sboxdlrmeventhubns_RootManageSharedAccessKey_EVENTHUB" = (sensitive value)
        }
      + builtin_logging_enabled                        = true
      + client_certificate_enabled                     = false
      + client_certificate_mode                        = "Optional"
      + content_share_force_disabled                   = false
      + custom_domain_verification_id                  = (sensitive value)
      + daily_memory_time_quota                        = 0
      + default_hostname                               = (known after apply)
      + enabled                                        = true
      + ftp_publish_basic_authentication_enabled       = true
      + functions_extension_version                    = "~4"
      + hosting_environment_id                         = (known after apply)
      + https_only                                     = false
      + id                                             = (known after apply)
      + key_vault_reference_identity_id                = (known after apply)
      + kind                                           = (known after apply)
      + location                                       = "uksouth"
      + name                                           = "af-apl-sbox-uks-dlrm-01"
      + outbound_ip_address_list                       = (known after apply)
      + outbound_ip_addresses                          = (known after apply)
      + possible_outbound_ip_address_list              = (known after apply)
      + possible_outbound_ip_addresses                 = (known after apply)
      + public_network_access_enabled                  = true
      + resource_group_name                            = "ingest02-main-sbox"
      + service_plan_id                                = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/ingest02-main-sbox/providers/Microsoft.Web/serverFarms/af-apl-sbox-uks-dlrm-01"
      + site_credential                                = (sensitive value)
      + storage_account_access_key                     = (sensitive value)
      + storage_account_name                           = "ingest02xcuttingsbox"
      + storage_uses_managed_identity                  = false
      + tags                                           = {
          + "application"  = "dlrm-data-ingest"
          + "builtFrom"    = "hmcts/dlrm-data-ingest-aria"
          + "businessArea" = "cross-cutting"
          + "criticality"  = "Low"
          + "environment"  = "sandbox"
          + "expiresAfter" = "3000-01-01"
        }
      + virtual_network_backup_restore_enabled         = false
      + vnet_image_pull_enabled                        = false
      + webdeploy_publish_basic_authentication_enabled = true
      + zip_deploy_file                                = (known after apply)

      + site_config {
          + always_on                               = false
          + app_scale_limit                         = (known after apply)
          + container_registry_use_managed_identity = false
          + default_documents                       = (known after apply)
          + detailed_error_logging_enabled          = (known after apply)
          + elastic_instance_minimum                = (known after apply)
          + ftps_state                              = "Disabled"
          + http2_enabled                           = false
          + ip_restriction_default_action           = "Allow"
          + linux_fx_version                        = (known after apply)
          + load_balancing_mode                     = "LeastRequests"
          + managed_pipeline_mode                   = "Integrated"
          + minimum_tls_version                     = "1.2"
          + pre_warmed_instance_count               = (known after apply)
          + remote_debugging_enabled                = false
          + remote_debugging_version                = (known after apply)
          + scm_ip_restriction_default_action       = "Allow"
          + scm_minimum_tls_version                 = "1.2"
          + scm_type                                = (known after apply)
          + scm_use_main_ip_restriction             = false
          + use_32_bit_worker                       = false
          + vnet_route_all_enabled                  = false
          + websockets_enabled                      = false
          + worker_count                            = (known after apply)

          + application_stack {
              + python_version              = "3.10"
              + use_dotnet_isolated_runtime = false
            }
        }
    }

  # azurerm_linux_function_app.example["02-af-apluta-sbox-uks-dlrm-01"] will be created
  + resource "azurerm_linux_function_app" "example" {
      + app_settings                                   = {
          + "APPLICATIONINSIGHTS_CONNECTION_STRING"                 = (sensitive value)
          + "AzureWebJobsFeatureFlags"                              = "EnableWorkerIndexing"
          + "BUILD_FLAGS"                                           = "UseExpressBuild"
          + "ENABLE_ORYX_BUILD"                                     = "true"
          + "FUNCTIONS_WORKER_RUNTIME"                              = "python"
          + "PYTHON_ENABLE_WORKER_EXTENSIONS"                       = "1"
          + "SCM_DO_BUILD_DURING_DEPLOYMENT"                        = "1"
          + "WEBSITE_RUN_FROM_PACKAGE"                              = "1"
          + "XDG_CACHE_HOME"                                        = "/tmp/.cache"
          + "sboxdlrmeventhubns_RootManageSharedAccessKey_EVENTHUB" = (sensitive value)
        }
      + builtin_logging_enabled                        = true
      + client_certificate_enabled                     = false
      + client_certificate_mode                        = "Optional"
      + content_share_force_disabled                   = false
      + custom_domain_verification_id                  = (sensitive value)
      + daily_memory_time_quota                        = 0
      + default_hostname                               = (known after apply)
      + enabled                                        = true
      + ftp_publish_basic_authentication_enabled       = true
      + functions_extension_version                    = "~4"
      + hosting_environment_id                         = (known after apply)
      + https_only                                     = false
      + id                                             = (known after apply)
      + key_vault_reference_identity_id                = (known after apply)
      + kind                                           = (known after apply)
      + location                                       = "uksouth"
      + name                                           = "af-apluta-sbox-uks-dlrm-01"
      + outbound_ip_address_list                       = (known after apply)
      + outbound_ip_addresses                          = (known after apply)
      + possible_outbound_ip_address_list              = (known after apply)
      + possible_outbound_ip_addresses                 = (known after apply)
      + public_network_access_enabled                  = true
      + resource_group_name                            = "ingest02-main-sbox"
      + service_plan_id                                = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/ingest02-main-sbox/providers/Microsoft.Web/serverFarms/af-apluta-sbox-uks-dlrm-01"
      + site_credential                                = (sensitive value)
      + storage_account_access_key                     = (sensitive value)
      + storage_account_name                           = "ingest02xcuttingsbox"
      + storage_uses_managed_identity                  = false
      + tags                                           = {
          + "application"  = "dlrm-data-ingest"
          + "builtFrom"    = "hmcts/dlrm-data-ingest-aria"
          + "businessArea" = "cross-cutting"
          + "criticality"  = "Low"
          + "environment"  = "sandbox"
          + "expiresAfter" = "3000-01-01"
        }
      + virtual_network_backup_restore_enabled         = false
      + vnet_image_pull_enabled                        = false
      + webdeploy_publish_basic_authentication_enabled = true
      + zip_deploy_file                                = (known after apply)

      + site_config {
          + always_on                               = false
          + app_scale_limit                         = (known after apply)
          + container_registry_use_managed_identity = false
          + default_documents                       = (known after apply)
          + detailed_error_logging_enabled          = (known after apply)
          + elastic_instance_minimum                = (known after apply)
          + ftps_state                              = "Disabled"
          + http2_enabled                           = false
          + ip_restriction_default_action           = "Allow"
          + linux_fx_version                        = (known after apply)
          + load_balancing_mode                     = "LeastRequests"
          + managed_pipeline_mode                   = "Integrated"
          + minimum_tls_version                     = "1.2"
          + pre_warmed_instance_count               = (known after apply)
          + remote_debugging_enabled                = false
          + remote_debugging_version                = (known after apply)
          + scm_ip_restriction_default_action       = "Allow"
          + scm_minimum_tls_version                 = "1.2"
          + scm_type                                = (known after apply)
          + scm_use_main_ip_restriction             = false
          + use_32_bit_worker                       = false
          + vnet_route_all_enabled                  = false
          + websockets_enabled                      = false
          + worker_count                            = (known after apply)

          + application_stack {
              + python_version              = "3.10"
              + use_dotnet_isolated_runtime = false
            }
        }
    }

  # azurerm_linux_function_app.example["02-af-bails-sbox-uks-dlrm-01"] will be created
  + resource "azurerm_linux_function_app" "example" {
      + app_settings                                   = {
          + "APPLICATIONINSIGHTS_CONNECTION_STRING"                 = (sensitive value)
          + "AzureWebJobsFeatureFlags"                              = "EnableWorkerIndexing"
          + "BUILD_FLAGS"                                           = "UseExpressBuild"
          + "ENABLE_ORYX_BUILD"                                     = "true"
          + "FUNCTIONS_WORKER_RUNTIME"                              = "python"
          + "PYTHON_ENABLE_WORKER_EXTENSIONS"                       = "1"
          + "SCM_DO_BUILD_DURING_DEPLOYMENT"                        = "1"
          + "WEBSITE_RUN_FROM_PACKAGE"                              = "1"
          + "XDG_CACHE_HOME"                                        = "/tmp/.cache"
          + "sboxdlrmeventhubns_RootManageSharedAccessKey_EVENTHUB" = (sensitive value)
        }
      + builtin_logging_enabled                        = true
      + client_certificate_enabled                     = false
      + client_certificate_mode                        = "Optional"
      + content_share_force_disabled                   = false
      + custom_domain_verification_id                  = (sensitive value)
      + daily_memory_time_quota                        = 0
      + default_hostname                               = (known after apply)
      + enabled                                        = true
      + ftp_publish_basic_authentication_enabled       = true
      + functions_extension_version                    = "~4"
      + hosting_environment_id                         = (known after apply)
      + https_only                                     = false
      + id                                             = (known after apply)
      + key_vault_reference_identity_id                = (known after apply)
      + kind                                           = (known after apply)
      + location                                       = "uksouth"
      + name                                           = "af-bails-sbox-uks-dlrm-01"
      + outbound_ip_address_list                       = (known after apply)
      + outbound_ip_addresses                          = (known after apply)
      + possible_outbound_ip_address_list              = (known after apply)
      + possible_outbound_ip_addresses                 = (known after apply)
      + public_network_access_enabled                  = true
      + resource_group_name                            = "ingest02-main-sbox"
      + service_plan_id                                = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/ingest02-main-sbox/providers/Microsoft.Web/serverFarms/af-bails-sbox-uks-dlrm-01"
      + site_credential                                = (sensitive value)
      + storage_account_access_key                     = (sensitive value)
      + storage_account_name                           = "ingest02xcuttingsbox"
      + storage_uses_managed_identity                  = false
      + tags                                           = {
          + "application"  = "dlrm-data-ingest"
          + "builtFrom"    = "hmcts/dlrm-data-ingest-aria"
          + "businessArea" = "cross-cutting"
          + "criti

# ...
# ... The maximum length of GitHub Comment is 65536, so the content is omitted by tfcmt.
# ...

ation    = false -> null
      - dns_endpoint_type                  = "Standard" -> null
      - https_traffic_only_enabled         = true -> null
      - id                                 = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/ingest02-main-sbox/providers/Microsoft.Storage/storageAccounts/afaplutasboxuksdlrm01" -> null
      - infrastructure_encryption_enabled  = false -> null
      - is_hns_enabled                     = false -> null
      - large_file_share_enabled           = false -> null
      - local_user_enabled                 = true -> null
      - location                           = "uksouth" -> null
      - min_tls_version                    = "TLS1_2" -> null
      - name                               = "afaplutasboxuksdlrm01" -> null
      - nfsv3_enabled                      = false -> null
      - primary_access_key                 = (sensitive value) -> null
      - primary_blob_connection_string     = (sensitive value) -> null
      - primary_blob_endpoint              = "https://afaplutasboxuksdlrm01.blob.core.windows.net/" -> null
      - primary_blob_host                  = "afaplutasboxuksdlrm01.blob.core.windows.net" -> null
      - primary_connection_string          = (sensitive value) -> null
      - primary_dfs_endpoint               = "https://afaplutasboxuksdlrm01.dfs.core.windows.net/" -> null
      - primary_dfs_host                   = "afaplutasboxuksdlrm01.dfs.core.windows.net" -> null
      - primary_file_endpoint              = "https://afaplutasboxuksdlrm01.file.core.windows.net/" -> null
      - primary_file_host                  = "afaplutasboxuksdlrm01.file.core.windows.net" -> null
      - primary_location                   = "uksouth" -> null
      - primary_queue_endpoint             = "https://afaplutasboxuksdlrm01.queue.core.windows.net/" -> null
      - primary_queue_host                 = "afaplutasboxuksdlrm01.queue.core.windows.net" -> null
      - primary_table_endpoint             = "https://afaplutasboxuksdlrm01.table.core.windows.net/" -> null
      - primary_table_host                 = "afaplutasboxuksdlrm01.table.core.windows.net" -> null
      - primary_web_endpoint               = "https://afaplutasboxuksdlrm01.z33.web.core.windows.net/" -> null
      - primary_web_host                   = "afaplutasboxuksdlrm01.z33.web.core.windows.net" -> null
      - public_network_access_enabled      = true -> null
      - queue_encryption_key_type          = "Service" -> null
      - resource_group_name                = "ingest02-main-sbox" -> null
      - secondary_access_key               = (sensitive value) -> null
      - secondary_connection_string        = (sensitive value) -> null
      - sftp_enabled                       = false -> null
      - shared_access_key_enabled          = true -> null
      - table_encryption_key_type          = "Service" -> null
      - tags                               = {
          - "application"  = "dlrm-data-ingest"
          - "builtFrom"    = "hmcts/dlrm-data-ingest-aria"
          - "businessArea" = "cross-cutting"
          - "criticality"  = "Low"
          - "environment"  = "sandbox"
          - "expiresAfter" = "3000-01-01"
        } -> null
        # (56 unchanged attributes hidden)

      - blob_properties {
          - change_feed_enabled           = false -> null
          - change_feed_retention_in_days = 0 -> null
          - last_access_time_enabled      = false -> null
          - versioning_enabled            = false -> null
            # (1 unchanged attribute hidden)
        }

      - queue_properties {
          - hour_metrics {
              - enabled               = false -> null
              - include_apis          = false -> null
              - retention_policy_days = 0 -> null
              - version               = "1.0" -> null
            }
          - logging {
              - delete                = false -> null
              - read                  = false -> null
              - retention_policy_days = 0 -> null
              - version               = "1.0" -> null
              - write                 = false -> null
            }
          - minute_metrics {
              - enabled               = false -> null
              - include_apis          = false -> null
              - retention_policy_days = 0 -> null
              - version               = "1.0" -> null
            }
        }

      - share_properties {
          - retention_policy {
              - days = 7 -> null
            }
        }
    }

  # azurerm_storage_account.example["02-af-bails-sbox-uks-dlrm-01"] will be destroyed
  # (because azurerm_storage_account.example is not in configuration)
  - resource "azurerm_storage_account" "example" {
      - access_tier                        = "Hot" -> null
      - account_kind                       = "StorageV2" -> null
      - account_replication_type           = "LRS" -> null
      - account_tier                       = "Standard" -> null
      - allow_nested_items_to_be_public    = true -> null
      - cross_tenant_replication_enabled   = false -> null
      - default_to_oauth_authentication    = false -> null
      - dns_endpoint_type                  = "Standard" -> null
      - https_traffic_only_enabled         = true -> null
      - id                                 = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/ingest02-main-sbox/providers/Microsoft.Storage/storageAccounts/afbailssboxuksdlrm01" -> null
      - infrastructure_encryption_enabled  = false -> null
      - is_hns_enabled                     = false -> null
      - large_file_share_enabled           = false -> null
      - local_user_enabled                 = true -> null
      - location                           = "uksouth" -> null
      - min_tls_version                    = "TLS1_2" -> null
      - name                               = "afbailssboxuksdlrm01" -> null
      - nfsv3_enabled                      = false -> null
      - primary_access_key                 = (sensitive value) -> null
      - primary_blob_connection_string     = (sensitive value) -> null
      - primary_blob_endpoint              = "https://afbailssboxuksdlrm01.blob.core.windows.net/" -> null
      - primary_blob_host                  = "afbailssboxuksdlrm01.blob.core.windows.net" -> null
      - primary_connection_string          = (sensitive value) -> null
      - primary_dfs_endpoint               = "https://afbailssboxuksdlrm01.dfs.core.windows.net/" -> null
      - primary_dfs_host                   = "afbailssboxuksdlrm01.dfs.core.windows.net" -> null
      - primary_file_endpoint              = "https://afbailssboxuksdlrm01.file.core.windows.net/" -> null
      - primary_file_host                  = "afbailssboxuksdlrm01.file.core.windows.net" -> null
      - primary_location                   = "uksouth" -> null
      - primary_queue_endpoint             = "https://afbailssboxuksdlrm01.queue.core.windows.net/" -> null
      - primary_queue_host                 = "afbailssboxuksdlrm01.queue.core.windows.net" -> null
      - primary_table_endpoint             = "https://afbailssboxuksdlrm01.table.core.windows.net/" -> null
      - primary_table_host                 = "afbailssboxuksdlrm01.table.core.windows.net" -> null
      - primary_web_endpoint               = "https://afbailssboxuksdlrm01.z33.web.core.windows.net/" -> null
      - primary_web_host                   = "afbailssboxuksdlrm01.z33.web.core.windows.net" -> null
      - public_network_access_enabled      = true -> null
      - queue_encryption_key_type          = "Service" -> null
      - resource_group_name                = "ingest02-main-sbox" -> null
      - secondary_access_key               = (sensitive value) -> null
      - secondary_connection_string        = (sensitive value) -> null
      - sftp_enabled                       = false -> null
      - shared_access_key_enabled          = true -> null
      - table_encryption_key_type          = "Service" -> null
      - tags                               = {
          - "application"  = "dlrm-data-ingest"
          - "builtFrom"    = "hmcts/dlrm-data-ingest-aria"
          - "businessArea" = "cross-cutting"
          - "criticality"  = "Low"
          - "environment"  = "sandbox"
          - "expiresAfter" = "3000-01-01"
        } -> null
        # (56 unchanged attributes hidden)

      - blob_properties {
          - change_feed_enabled           = false -> null
          - change_feed_retention_in_days = 0 -> null
          - last_access_time_enabled      = false -> null
          - versioning_enabled            = false -> null
            # (1 unchanged attribute hidden)
        }

      - queue_properties {
          - hour_metrics {
              - enabled               = false -> null
              - include_apis          = false -> null
              - retention_policy_days = 0 -> null
              - version               = "1.0" -> null
            }
          - logging {
              - delete                = false -> null
              - read                  = false -> null
              - retention_policy_days = 0 -> null
              - version               = "1.0" -> null
              - write                 = false -> null
            }
          - minute_metrics {
              - enabled               = false -> null
              - include_apis          = false -> null
              - retention_policy_days = 0 -> null
              - version               = "1.0" -> null
            }
        }

      - share_properties {
          - retention_policy {
              - days = 7 -> null
            }
        }
    }

  # azurerm_storage_account.example["02-af-joh-sbox-uks-dlrm-01"] will be destroyed
  # (because azurerm_storage_account.example is not in configuration)
  - resource "azurerm_storage_account" "example" {
      - access_tier                        = "Hot" -> null
      - account_kind                       = "StorageV2" -> null
      - account_replication_type           = "LRS" -> null
      - account_tier                       = "Standard" -> null
      - allow_nested_items_to_be_public    = true -> null
      - cross_tenant_replication_enabled   = false -> null
      - default_to_oauth_authentication    = false -> null
      - dns_endpoint_type                  = "Standard" -> null
      - https_traffic_only_enabled         = true -> null
      - id                                 = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/ingest02-main-sbox/providers/Microsoft.Storage/storageAccounts/afjohsboxuksdlrm01" -> null
      - infrastructure_encryption_enabled  = false -> null
      - is_hns_enabled                     = false -> null
      - large_file_share_enabled           = false -> null
      - local_user_enabled                 = true -> null
      - location                           = "uksouth" -> null
      - min_tls_version                    = "TLS1_2" -> null
      - name                               = "afjohsboxuksdlrm01" -> null
      - nfsv3_enabled                      = false -> null
      - primary_access_key                 = (sensitive value) -> null
      - primary_blob_connection_string     = (sensitive value) -> null
      - primary_blob_endpoint              = "https://afjohsboxuksdlrm01.blob.core.windows.net/" -> null
      - primary_blob_host                  = "afjohsboxuksdlrm01.blob.core.windows.net" -> null
      - primary_connection_string          = (sensitive value) -> null
      - primary_dfs_endpoint               = "https://afjohsboxuksdlrm01.dfs.core.windows.net/" -> null
      - primary_dfs_host                   = "afjohsboxuksdlrm01.dfs.core.windows.net" -> null
      - primary_file_endpoint              = "https://afjohsboxuksdlrm01.file.core.windows.net/" -> null
      - primary_file_host                  = "afjohsboxuksdlrm01.file.core.windows.net" -> null
      - primary_location                   = "uksouth" -> null
      - primary_queue_endpoint             = "https://afjohsboxuksdlrm01.queue.core.windows.net/" -> null
      - primary_queue_host                 = "afjohsboxuksdlrm01.queue.core.windows.net" -> null
      - primary_table_endpoint             = "https://afjohsboxuksdlrm01.table.core.windows.net/" -> null
      - primary_table_host                 = "afjohsboxuksdlrm01.table.core.windows.net" -> null
      - primary_web_endpoint               = "https://afjohsboxuksdlrm01.z33.web.core.windows.net/" -> null
      - primary_web_host                   = "afjohsboxuksdlrm01.z33.web.core.windows.net" -> null
      - public_network_access_enabled      = true -> null
      - queue_encryption_key_type          = "Service" -> null
      - resource_group_name                = "ingest02-main-sbox" -> null
      - secondary_access_key               = (sensitive value) -> null
      - secondary_connection_string        = (sensitive value) -> null
      - sftp_enabled                       = false -> null
      - shared_access_key_enabled          = true -> null
      - table_encryption_key_type          = "Service" -> null
      - tags                               = {
          - "application"  = "dlrm-data-ingest"
          - "builtFrom"    = "hmcts/dlrm-data-ingest-aria"
          - "businessArea" = "cross-cutting"
          - "criticality"  = "Low"
          - "environment"  = "sandbox"
          - "expiresAfter" = "3000-01-01"
        } -> null
        # (56 unchanged attributes hidden)

      - blob_properties {
          - change_feed_enabled           = false -> null
          - change_feed_retention_in_days = 0 -> null
          - last_access_time_enabled      = false -> null
          - versioning_enabled            = false -> null
            # (1 unchanged attribute hidden)
        }

      - queue_properties {
          - hour_metrics {
              - enabled               = false -> null
              - include_apis          = false -> null
              - retention_policy_days = 0 -> null
              - version               = "1.0" -> null
            }
          - logging {
              - delete                = false -> null
              - read                  = false -> null
              - retention_policy_days = 0 -> null
              - version               = "1.0" -> null
              - write                 = false -> null
            }
          - minute_metrics {
              - enabled               = false -> null
              - include_apis          = false -> null
              - retention_policy_days = 0 -> null
              - version               = "1.0" -> null
            }
        }

      - share_properties {
          - retention_policy {
              - days = 7 -> null
            }
        }
    }

  # azurerm_storage_account.example["02-af-sbails-sbox-uks-dlrm-01"] will be destroyed
  # (because azurerm_storage_account.example is not in configuration)
  - resource "azurerm_storage_account" "example" {
      - access_tier                        = "Hot" -> null
      - account_kind                       = "StorageV2" -> null
      - account_replication_type           = "LRS" -> null
      - account_tier                       = "Standard" -> null
      - allow_nested_items_to_be_public    = true -> null
      - cross_tenant_replication_enabled   = false -> null
      - default_to_oauth_authentication    = false -> null
      - dns_endpoint_type                  = "Standard" -> null
      - https_traffic_only_enabled         = true -> null
      - id                                 = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/ingest02-main-sbox/providers/Microsoft.Storage/storageAccounts/afsbailssboxuksdlrm01" -> null
      - infrastructure_encryption_enabled  = false -> null
      - is_hns_enabled                     = false -> null
      - large_file_share_enabled           = false -> null
      - local_user_enabled                 = true -> null
      - location                           = "uksouth" -> null
      - min_tls_version                    = "TLS1_2" -> null
      - name                               = "afsbailssboxuksdlrm01" -> null
      - nfsv3_enabled                      = false -> null
      - primary_access_key                 = (sensitive value) -> null
      - primary_blob_connection_string     = (sensitive value) -> null
      - primary_blob_endpoint              = "https://afsbailssboxuksdlrm01.blob.core.windows.net/" -> null
      - primary_blob_host                  = "afsbailssboxuksdlrm01.blob.core.windows.net" -> null
      - primary_connection_string          = (sensitive value) -> null
      - primary_dfs_endpoint               = "https://afsbailssboxuksdlrm01.dfs.core.windows.net/" -> null
      - primary_dfs_host                   = "afsbailssboxuksdlrm01.dfs.core.windows.net" -> null
      - primary_file_endpoint              = "https://afsbailssboxuksdlrm01.file.core.windows.net/" -> null
      - primary_file_host                  = "afsbailssboxuksdlrm01.file.core.windows.net" -> null
      - primary_location                   = "uksouth" -> null
      - primary_queue_endpoint             = "https://afsbailssboxuksdlrm01.queue.core.windows.net/" -> null
      - primary_queue_host                 = "afsbailssboxuksdlrm01.queue.core.windows.net" -> null
      - primary_table_endpoint             = "https://afsbailssboxuksdlrm01.table.core.windows.net/" -> null
      - primary_table_host                 = "afsbailssboxuksdlrm01.table.core.windows.net" -> null
      - primary_web_endpoint               = "https://afsbailssboxuksdlrm01.z33.web.core.windows.net/" -> null
      - primary_web_host                   = "afsbailssboxuksdlrm01.z33.web.core.windows.net" -> null
      - public_network_access_enabled      = true -> null
      - queue_encryption_key_type          = "Service" -> null
      - resource_group_name                = "ingest02-main-sbox" -> null
      - secondary_access_key               = (sensitive value) -> null
      - secondary_connection_string        = (sensitive value) -> null
      - sftp_enabled                       = false -> null
      - shared_access_key_enabled          = true -> null
      - table_encryption_key_type          = "Service" -> null
      - tags                               = {
          - "application"  = "dlrm-data-ingest"
          - "builtFrom"    = "hmcts/dlrm-data-ingest-aria"
          - "businessArea" = "cross-cutting"
          - "criticality"  = "Low"
          - "environment"  = "sandbox"
          - "expiresAfter" = "3000-01-01"
        } -> null
        # (56 unchanged attributes hidden)

      - blob_properties {
          - change_feed_enabled           = false -> null
          - change_feed_retention_in_days = 0 -> null
          - last_access_time_enabled      = false -> null
          - versioning_enabled            = false -> null
            # (1 unchanged attribute hidden)
        }

      - queue_properties {
          - hour_metrics {
              - enabled               = false -> null
              - include_apis          = false -> null
              - retention_policy_days = 0 -> null
              - version               = "1.0" -> null
            }
          - logging {
              - delete                = false -> null
              - read                  = false -> null
              - retention_policy_days = 0 -> null
              - version               = "1.0" -> null
              - write                 = false -> null
            }
          - minute_metrics {
              - enabled               = false -> null
              - include_apis          = false -> null
              - retention_policy_days = 0 -> null
              - version               = "1.0" -> null
            }
        }

      - share_properties {
          - retention_policy {
              - days = 7 -> null
            }
        }
    }

Plan: 7 to add, 0 to change, 7 to destroy.
```

</details>





<!-- github-comment: {"Command":"plan","PRNumber":22,"Program":"tfcmt","SHA1":"","Target":"1112: sbox_aria - Terraform Plan Apply","Vars":{}} -->